{"version": "https://jsonfeed.org/version/1", "title": "TRAKI", "home_page_url": null, "feed_url": null, "description": null, "icon": null, "authors": [], "language": "en", "items": [{"id": null, "url": null, "title": "Where we @", "content_html": "<h1>Where we @</h1>\n<p>Greetings,</p>\n<p>I'm a day and a half early with this, but considering that the report schedule is all over the place anyway, I hope you guys don't mind too much.</p>\n<p>In any case... I've been hammering at day three stuff pretty extensively over the last couple of days. This means that I had to fill in a bunch of scenes while rewriting and streamlining others. </p>\n<p>That being said, day three is now officially complete. At least in theory. I gotta say, I did get super emotional towards the end, seeing as a narrative that I've put more than six hundred hours into finally takes shape. I've grown incredibly fond of all the characters and at this point it feels like they've written themselves, for the most part.</p>\n<p>But I'm digressing. </p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-06-04.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Status", "content_html": "<h1>Status</h1>\n<p>Yo,</p>\n<p>I've been working on Trachi pretty extensively over the last week. As you might have noticed, I've uploaded a bunch of screenshots recently, since I've finally got around to focus on mapping for a few days straight.</p>\n<p>As a result: <strong>All the outdoor areas are now done</strong>, barring minor cosmetic changes. \nTo put it into perspective: The prologue had around 30 maps. \nRight now, we're sitting at around 90 for the main game and 120 in total.</p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-06-13.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Round two", "content_html": "<h1>Round two</h1>\n<p>Alright lads, this is a big one.</p>\n<p>As always, though, I'll start with an apology on how I missed last week's report. In addition, I have also not managed to work much on the main game of Trachi, barring a few changes here and there.</p>\n<p>The reason for that, is that replaying the prologue made me realize how very much lacking it was in many different respects. Remember how I said that I'd actually remake it at some point after I released the main game? Well, as it turns out, I've changed the schedule again. </p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-06-20.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Teaser and Status", "content_html": "<h1>Teaser and Status</h1>\n<p>Hey Friendos,</p>\n<p>it's been a minute since I've posted a proper update on the status of Act. So let me use this one to catch up on a few things.</p>\n<p>First of all, the Teaser for Act 1 has been released:</p>\n<p>I had a lot of fun experimenting with lighting and footstep sounds, and I'm very excited to implement them properly and retrocactively from now on.</p>\n<p><strong>As for the general status of Act 1:</strong>\nAll but two important characters have been remade and implemented. </p>\n<p>I have also finished the first batch of NPCs today. Right now, I'm sitting at 29, however I expect this will increase to around 50-ish by the end of of it. </p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-07-10.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Judgement Day", "content_html": "<h1>Judgement Day</h1>\n<p>Time's up.\n<strong>And so is Trachi 1.2.</strong></p>\n<p>In the download section, you'll find a file.\n<strong>Open it.</strong></p>\n<p>You remember that city I was talking about?\n...</p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-07-31.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Hotfix out", "content_html": "<h1>Hotfix out</h1>\n<p>Hey again (weird to this twice in a single day..),</p>\n<p>The thing is...\nI got some immediate feedback, earlier, that some of the <strong>plugins were causing trouble</strong>.</p>\n<p>Thankfully, I was able to fix the majority of them over the course of the day. \nThey were also mostly centered on the <strong>earlier parts of Act 1</strong>. </p>\n<p>So if you're well into the game, <strong>you shouldn't run into any problems</strong>. \nHowever, if you happen to do so, please don't hesitate to drop me a message.</p>\n<p>This way, I can have a deeper look at the issue, and also supply you with a fix, right away.</p>\n<p>In any case, the downloads page has been <strong>updated with the new version (1.2a)</strong>. \nI'll probably release a couple of hotfixes over the next few days, as well.</p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-08-01.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Deucalion &amp; beyond", "content_html": "<h1>Deucalion &amp; beyond</h1>\n<p><strong>Hey friends,</strong></p>\n<p>I have a bunch of announcements, so please bear with me!</p>\n<p>First of all, the teaser for Act 2 has just been released.</p>\n<p>As always, I tried not give too much away and I encourage everyone to check it out, <strong>regardless if you've ventured into the world of Trachi, or not</strong>.</p>\n<p>There will likely not be a second teaser for 1.3, since I want to focus on creating a <strong>proper cinematic trailer</strong>, instead.\nI'm still playing with ideas for that, but it will definitely feature a <strong>musical backdrop</strong>, flanked by <strong>various scenes from Act 2</strong>.\n<em>And maybe, if it turns out to be good enough, it might also include the recital of a little poem I wrote for it.</em></p>\n<p>In any case, the trailer is scheduled to be unveiled on <strong>September 23rd</strong>.</p>\n<p>And one week after that, <strong>1.3 (InfestAtion)</strong> will be released:</p>\n<p><strong>That's right, we have a date, you and I!</strong></p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-08-31.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "State of the city", "content_html": "<h1>State of the city</h1>\n<p>Hey Folks!</p>\n<p>This will be a longer entry, so I'll get straight to the point.</p>\n<p>First of all, I want to thank my dear friend jayseeffaye for featuring Trachi with a full play-through on his stream.\nI highly encourage you to check it out. I had a blast watching it, and I'm sure you will, too!</p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-09-07.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Cumparsita (aka: what's new?)", "content_html": "<h1>Cumparsita (aka: what's new?)</h1>\n<p><strong>Howdy!</strong></p>\n<p>Guess who's on time.\nNot me, for sure.</p>\n<p>But anyways, I'll get right to it.</p>\n<p>Before that, though, I want to do a quick shout out to a very wholesome and amazing streamer:</p>\n<p>The great and amazing yingy did a play through of the prologue and parts of Act 1 on her stream, today!\nSo please, if Trachi by itself is too boring for you (which I can emphasise with), please make sure to check out the corresponding vod here.</p>\n<p>With that being said, let's look at where we @:</p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-09-16.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Actual Saturday Update", "content_html": "<h1>Actual Saturday Update</h1>\n<p><strong>Hey,</strong>\nI kinda wrote this devlog yesterday already, but forgot to save the draft (keklmao).\nSo I'll try to be extra concise here.\nIn other words: take notes, Square Enix.\nThis is how you announce stuff.\nJK JK, I loved the job trailer, hehe!\nAnyways, let's start of by looking at what's going to happen, next weekend.\nThere will likely not be a devlog there, since I'll do the preview of 1.3 sometime around next week.\nThe reason for that is we have something a lot more awesome planned, instead.</p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-09-18.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "It's 6 AM in the morning, and I'm almost done", "content_html": "<h1>It's 6 AM in the morning, and I'm almost done</h1>\n<p><strong>Hey friends,</strong></p>\n<p>I totally forgot to post the prog update here, as well.</p>\n<p>And because it's pretty late (or early, depending on your definition, I'll just drop a link to the post on itch).</p>\n<p>Now, a lot has happened over the past week.\nSo let me, quickly recapitulate:</p>\n<p>There will unfortunately not be a release stream for 1.3, since we ran into some scheduling issues.\nI'm sorry about that, but the entire thing kinda exploded in how many people are planning to participate.\nSo instead of delaying it a few weeks, we'll push it all the way to <strong>mid-november</strong>.</p>", "image": "Noneassets/images/social/blog/posts/Archive/RPGMaker.net/RPGM_21-09-24.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "A decade of Trachi", "content_html": "<h1>A decade of Trachi</h1>\n<p>Hey dudes,\nsince I only recently migrated this game to itch.io, I thought it'd be a good idea to bring you up to speed on a few things. If you are interested in reading previous progress reports, feel free check them out on the game's <a href=\"https://rpgmaker.net/games/11250/\">RMN profile</a>.\nThat being said, let's cover a few cornerstones in the development history of <a href=\"https://noury.itch.io/trachi\">Trachi</a></p>\n<h3>Conceptualisation</h3>\n<p>It's hard to pinpoint a proper starting point, since the idea of creating this particular fictional world is already more than ten years old, and has gone through a lot of different iterations in the meantime. I think it was 2011 when I first started conceptualizing a few places by writing descriptions, drawing maps and the first locations. Back then, the world looked a lot more different in that it was more aligned to a generic fantasy world. Naturally, works such as Lord of the rings, A Song of Ice and Fire, but also Guild Wars and The Witcher series were a big inspiration to me in that regard.\nI think I wrote between two and three hundred pages trying to carve out the key points and dynamics of the world which didn't have a name yet. In fact, I think to this day one of my biggest struggles is coming up with names that are both unique and recognisable, while also being aesthetically pleasing in regards to their logographic and phonetical form. At some point in the future, I will go more into this, since it's a topic that not only interests me privately, but as a linguist also professionally.</p>", "image": "Noneassets/images/social/blog/posts/Archive/itch.io/ITCH_21-06-23.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Onwards", "content_html": "<h1>Onwards</h1>\n<p><strong>Greetings,</strong>\nin the last prog report, I promised to put out more infos on Act 1. And so I shall.\nKeep in mind I'm not good at deciding what's a spoiler and what's not. So I will just flag the lot of it as such.\nIn other words: <strong>SPOILERS</strong> abound</p>", "image": "Noneassets/images/social/blog/posts/Archive/itch.io/ITCH_21-06-28.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Metamorphosis", "content_html": "<h1>Metamorphosis</h1>\n<p>Howdy,\ngoodbyes are often the hardest things.\nTwo days ago, I was looking for ways to generate more characters, and stumbled upon the <a href=\"https://visustella.itch.io/stella-character-generator\"><strong>character generator</strong></a> by Stella.\nNow, I wasn't originally planning on redoing the characters at this specific point. But seeing the results and comparing them with ones from the built in generator kinda left me no choice.\nThe main characters mostly done now. I'll keep tinkering with them until I'm fully satisfied and then move on to the tertiary characters.</p>", "image": "Noneassets/images/social/blog/posts/Archive/itch.io/ITCH_21-07-01.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Trojan Boy", "content_html": "<h1>Trojan Boy</h1>\n<h2>Ganymede</h2>\n<p><img alt=\"\" src=\"https://img.itch.zone/aW1nLzY0MDc5MzMucG5n/original/Tugj1c.png\">\nBorn on the 3rd May 1903 in Waldnitz.\nRecruited into the <strong>Comissariat for External Affairs (CoExA) </strong>in 1919.\nIntegrated into the <strong>Ionian Intelligence Service (IIS)</strong> in 1922.</p>", "image": "Noneassets/images/social/blog/posts/Archive/itch.io/ITCH_21-07-02.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Old and New", "content_html": "<h1>Old and New</h1>\n<p>Hey lads,\nI've spent the last one and a half weeks primarily on remaking all the existing characters in a new generator.\nThe face images for the three main characters are now finally implemented. The other characters in Act 1 have their base finished as well and just need their face varieties implemented.\nBeyond that, there's only the walking sprites left to do. This shouldn't take too long however, and I still expect to meet the end of July deadline.\n<strong>Now, as for the remake of the characters:</strong>\nMuch of the effort went into trying to keep the general features behind the characters intact. However, there are some cases where this either proved impossible, or the new remade characters are much closer to how I envisaged them in the first place.</p>", "image": "Noneassets/images/social/blog/posts/Archive/itch.io/ITCH_21-07-04.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Teaser &amp; Status", "content_html": "<h1>Teaser &amp; Status</h1>\n<p>Hey Friendos,\nas you might have seen, I've released a first <strong>Teaser for Act 1</strong>, which I'd like to let speak for itself:\n&lt;div class=\"embe...</p>", "image": "Noneassets/images/social/blog/posts/Archive/itch.io/ITCH_21-07-10.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Release date", "content_html": "<h1>Release date</h1>\n<p><strong><em>*Hey again,\nwork on Act 1 is coming along nicely. All necessary characters have been ported and implemented successfully. And while some of them might have gotten a bit younger in their appearance, it does feel like they've all grown up a little.\nConcerning </em>*maps</strong>, all but two outdoor areas of Act 1 are ready for release. In other words, they feature:\n- a certain level of detail\n- a contribution to the narrative\n- fitting audio backdrop\n- NPCs, including dialogue</p>", "image": "Noneassets/images/social/blog/posts/Archive/itch.io/ITCH_21-07-18.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "Premortem", "content_html": "<h1>Premortem</h1>\n<p>Hey  fellas,\nit's Saturday the 24th July.<strong> One week from now, Trachi 1.2 will be released.</strong>\nSince this will probably the biggest update the game has ever received, I want to use this opportunity to take a look  at some of the roadblocks and tough decisions I've had to face during the course of development.\nI also had a few in-depth talks with some of the testers, recently. \nOn one hand, I received a lot of compliments and encouragements. And while I'm thankful for that, I here want to focus on a the parts of the game that they rightfully pointed out as being flawed.\n<strong>For this reason, I will not only cover game specific stuff, but also talk about general approaches to game design</strong> <strong>and project management</strong>. </p>\n<p>An emphasis will be put on <strong>heuristic decision making </strong>and <strong>path dependencies</strong>. To illustrate my considerations, I will showcase examples from project T during various stages of development.\nThat being said, let's start of with a comparison.</p>", "image": "Noneassets/images/social/blog/posts/Archive/itch.io/ITCH_21-07-24.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}, {"id": null, "url": null, "title": "1.2 (InfiltrAtion)", "content_html": "<h1>1.2 (InfiltrAtion)</h1>\n<p>Ladies and Gentlemen.\n Friends. \n<strong>ComrAdes.</strong>\nTime's up.\n**And so is the next chapter of Trachi.</p>\n<p><strong>After almost a thousand hours of development...\n </strong>I have a little gift for you.**\nPlease refer to the download section at your earliest convenience.\nYou will find a file, there.\nGo ahead.\n<img alt=\"\" src=\"https://img.itch.zone/aW1nLzY2MzQ1MjIucG5n/original/CHNABZ.png\"></p>", "image": "Noneassets/images/social/blog/posts/Archive/itch.io/ITCH_21-07-31.png", "date_modified": "2025-06-21T04:01:13+00:00", "authors": [], "tags": null}]}